{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "batch_input_shape": [null, 28, 28], "dtype": "float32", "target_shape": [784]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxoAAAB0AGoBfACIAGQBGQCIAGQCGQAZAGQDjQJTACkETtoM\nZHJvcG91dF9yYXRl2g9uYl9pbm5lcl9sYXllcnMpAdoFbGV2ZWwpAtoBS9oHZHJvcG91dCkB2gF4\nKQHaD2h5cGVycGFyYW1ldGVyc6kA+lUvaG9tZS90dWNoZS1rYWtpL0RvY3VtZW50cy9lbXNlL3By\nb2pldHMvcHJvamV0X3JlY2hlcmNoZS90cmFpbmluZy9yb2Jpbl9yZXBvL21vZGVsLnB52gg8bGFt\nYmRhPgoAAADzAAAAAA==\n", null, [{"nb_inner_layers": 4, "nb_neurons_per_layers": 25, "activation_function": "softmax", "batch_size": 50, "nb_epochs": 250, "loss": "mean_squared_error", "optimizer": "sgd", "metrics": ["categorical_accuracy"], "dropout_rate": [0.1, 0.1, 0.1, 0.1, 0.1], "experiment": "MC Dropout", "number": 18}]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 25, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBfACIAGQBGQCIARkAZAKNAlMAKQNO2gxkcm9w\nb3V0X3JhdGUpAdoFbGV2ZWwpAtoBS9oHZHJvcG91dCkB2gF4KQLaD2h5cGVycGFyYW1ldGVyc9oB\naakA+lUvaG9tZS90dWNoZS1rYWtpL0RvY3VtZW50cy9lbXNlL3Byb2pldHMvcHJvamV0X3JlY2hl\ncmNoZS90cmFpbmluZy9yb2Jpbl9yZXBvL21vZGVsLnB52gg8bGFtYmRhPg4AAADzAAAAAA==\n", null, [{"nb_inner_layers": 4, "nb_neurons_per_layers": 25, "activation_function": "softmax", "batch_size": 50, "nb_epochs": 250, "loss": "mean_squared_error", "optimizer": "sgd", "metrics": ["categorical_accuracy"], "dropout_rate": [0.1, 0.1, 0.1, 0.1, 0.1], "experiment": "MC Dropout", "number": 18}, 3]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 25, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBfACIAGQBGQCIARkAZAKNAlMAKQNO2gxkcm9w\nb3V0X3JhdGUpAdoFbGV2ZWwpAtoBS9oHZHJvcG91dCkB2gF4KQLaD2h5cGVycGFyYW1ldGVyc9oB\naakA+lUvaG9tZS90dWNoZS1rYWtpL0RvY3VtZW50cy9lbXNlL3Byb2pldHMvcHJvamV0X3JlY2hl\ncmNoZS90cmFpbmluZy9yb2Jpbl9yZXBvL21vZGVsLnB52gg8bGFtYmRhPg4AAADzAAAAAA==\n", null, [{"nb_inner_layers": 4, "nb_neurons_per_layers": 25, "activation_function": "softmax", "batch_size": 50, "nb_epochs": 250, "loss": "mean_squared_error", "optimizer": "sgd", "metrics": ["categorical_accuracy"], "dropout_rate": [0.1, 0.1, 0.1, 0.1, 0.1], "experiment": "MC Dropout", "number": 18}, 3]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 25, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBfACIAGQBGQCIARkAZAKNAlMAKQNO2gxkcm9w\nb3V0X3JhdGUpAdoFbGV2ZWwpAtoBS9oHZHJvcG91dCkB2gF4KQLaD2h5cGVycGFyYW1ldGVyc9oB\naakA+lUvaG9tZS90dWNoZS1rYWtpL0RvY3VtZW50cy9lbXNlL3Byb2pldHMvcHJvamV0X3JlY2hl\ncmNoZS90cmFpbmluZy9yb2Jpbl9yZXBvL21vZGVsLnB52gg8bGFtYmRhPg4AAADzAAAAAA==\n", null, [{"nb_inner_layers": 4, "nb_neurons_per_layers": 25, "activation_function": "softmax", "batch_size": 50, "nb_epochs": 250, "loss": "mean_squared_error", "optimizer": "sgd", "metrics": ["categorical_accuracy"], "dropout_rate": [0.1, 0.1, 0.1, 0.1, 0.1], "experiment": "MC Dropout", "number": 18}, 3]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 25, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBfACIAGQBGQCIARkAZAKNAlMAKQNO2gxkcm9w\nb3V0X3JhdGUpAdoFbGV2ZWwpAtoBS9oHZHJvcG91dCkB2gF4KQLaD2h5cGVycGFyYW1ldGVyc9oB\naakA+lUvaG9tZS90dWNoZS1rYWtpL0RvY3VtZW50cy9lbXNlL3Byb2pldHMvcHJvamV0X3JlY2hl\ncmNoZS90cmFpbmluZy9yb2Jpbl9yZXBvL21vZGVsLnB52gg8bGFtYmRhPg4AAADzAAAAAA==\n", null, [{"nb_inner_layers": 4, "nb_neurons_per_layers": 25, "activation_function": "softmax", "batch_size": 50, "nb_epochs": 250, "loss": "mean_squared_error", "optimizer": "sgd", "metrics": ["categorical_accuracy"], "dropout_rate": [0.1, 0.1, 0.1, 0.1, 0.1], "experiment": "MC Dropout", "number": 18}, 3]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}